# Copyright (C)  2014-2015 Richard Bäck.
# Permission is granted to copy, distribute and/or modify this document
# under the terms of the GNU Free Documentation License, Version 1.3 or
# any later version published by the Free Software Foundation; with no
# Invariant Sections, no Front-Cover Texts, and no Back-Cover Texts.  A
# copy of the license is included in the section entitled "GNU Free
# Documentation License".

** Console output[fn:1]

To write lines the "format"-function is the tool of choice.

Syntax: (format <t or nil> <outputtext> <variables>)

#+name: format-simple-example
#+BEGIN_SRC lisp :output
; if the second parameter is a nil the output string will be the return value
(format t "hello ~a~%~{1st val:~a; 2nd val:~a~}" "world" (list 2 1))
#+END_SRC

#+RESULTS: format-simple-example
: hello world
: 1st val:2; 2nd val:1
: nil
[fn:1] Practical Common Lisp - Chapter 18: A Few FORMAT Recipes
